@2i2c-org/engineering this could make you see new resources be created like below, which is expected and fine!

```
Terraform will perform the following actions:

  # google_storage_bucket.usage_logs_bucket will be created
  + resource "google_storage_bucket" "usage_logs_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "EUROPE-WEST1"
      + name                        = "qcl-gcs-usage-logs"
      + project                     = "qcl-hub"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }
          + condition {
              + age                   = 30
              + matches_prefix        = []
              + matches_storage_class = []
              + matches_suffix        = []
              + with_state            = (known after apply)
            }
        }
    }

  # google_storage_bucket_iam_member.usage_logs_bucket_access will be created
  + resource "google_storage_bucket_iam_member" "usage_logs_bucket_access" {
      + bucket = "qcl-gcs-usage-logs"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:cloud-storage-analytics@google.com"
      + role   = "roles/storage.objectCreator"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + usage_log_bucket                    = "qcl-gcs-usage-logs"
```